# Relational Algebra
---

`Relational algebra` is a `procedural query language`, which takes instances of relations as input and yields instances of relations as output. It uses operators to perform queries. An `operator` can be either unary or binary. They accept relations as their input and yield relations as their output.

### Connecting with the database

In [ ]:
%load_ext sql
# replace with your own credentials
%sql ibm_db_sa://my-username:my-password@dashdb-txn-sbox-yp-dal09-03.services.dal.bluemix.net:50000/BLUDB

### • <u>SELECT</u>
it is used to select the subset of the tuples of a relation that satisfies the selection condition.

In [2]:
%sql select * from STUDENTS

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('United States', 'Marshall', 'Bernadot', 54),
 ('United States', 'Celinda', 'Malkin', 51),
 ('Ukraine', 'Guillermo', 'Furze', 53),
 ('Ukraine', 'Aharon', 'Tunnow', 48),
 ('Russia', 'Bail', 'Goodwin', 46),
 ('Poland', 'Cole', 'Winteringham', 49),
 ('Sweden', 'Emlyn', 'Erricker', 55),
 ('Russia', 'Cathee', 'Sivewright', 49),
 ('Poland', 'Barny', 'Ingerson', 57),
 ('Sweden', 'Sharla', 'Papaccio', 55),
 ('Romania', 'Alina', 'Smolyar', 52)]

### • <u>PROJECT</u>
It selects only those columns or attributes in which the user is intersted.

In [3]:
%sql select first_name,test_score from STUDENTS

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('Marshall', 54),
 ('Celinda', 51),
 ('Guillermo', 53),
 ('Aharon', 48),
 ('Bail', 46),
 ('Cole', 49),
 ('Emlyn', 55),
 ('Cathee', 49),
 ('Barny', 57),
 ('Sharla', 55),
 ('Alina', 52)]

### • <u>SET OPERATIONS</u>

Lets make another table since we'll need two tables in the following operations.

In [4]:
%%sql

drop table NEW_STUDENTS;
create table NEW_STUDENTS (
	country VARCHAR(50),
	first_name VARCHAR(50),
	last_name VARCHAR(50),
	test_score INT
);
insert into NEW_STUDENTS (country, first_name, last_name, test_score)
values
('Mexico', 'Natasha', 'Martinax', 48),
('Mexico', 'Rachael', 'Grate', 45),
('Romania', 'Alexandra', 'Botez', 57),
('Romania', 'Alina', 'Smolyar', 52);
select * from NEW_STUDENTS

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.
Done.
4 rows affected.
Done.

[('Mexico', 'Natasha', 'Martinax', 48),
 ('Mexico', 'Rachael', 'Grate', 45),
 ('Romania', 'Alexandra', 'Botez', 57),
 ('Romania', 'Alina', 'Smolyar', 52)]

### 1. UNION
It is used to combine the results of two or more select statements. However it will eliminate duplicate rows from its result set. In case of union, number of columns and data type must be saame in all the tables.

In [5]:
%sql select * from STUDENTS union select * from NEW_STUDENTS

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('Mexico', 'Rachael', 'Grate', 45),
 ('Russia', 'Bail', 'Goodwin', 46),
 ('Mexico', 'Natasha', 'Martinax', 48),
 ('Ukraine', 'Aharon', 'Tunnow', 48),
 ('Russia', 'Cathee', 'Sivewright', 49),
 ('Poland', 'Cole', 'Winteringham', 49),
 ('United States', 'Celinda', 'Malkin', 51),
 ('Romania', 'Alina', 'Smolyar', 52),
 ('Ukraine', 'Guillermo', 'Furze', 53),
 ('United States', 'Marshall', 'Bernadot', 54),
 ('Sweden', 'Emlyn', 'Erricker', 55),
 ('Sweden', 'Sharla', 'Papaccio', 55),
 ('Romania', 'Alexandra', 'Botez', 57),
 ('Poland', 'Barny', 'Ingerson', 57)]

### 2. INTERSECTION
It returna the rows which are common in both the tables.

In [6]:
%sql select * from STUDENTS intersect select * from NEW_STUDENTS

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('Romania', 'Alina', 'Smolyar', 52)]

### 3. DIFFERENCE
It combines the result of two select staements and returns only those rows which belongs to first set of result.

In [7]:
%sql select STUDENTS.* from STUDENTS where STUDENTS.first_name not in ( select first_name from NEW_STUDENTS )

 * ibm_db_sa://lzv55210:***@dashdb-txn-sbox-yp-dal09-12.services.dal.bluemix.net:50000/BLUDB
Done.

[('United States', 'Marshall', 'Bernadot', 54),
 ('United States', 'Celinda', 'Malkin', 51),
 ('Ukraine', 'Guillermo', 'Furze', 53),
 ('Ukraine', 'Aharon', 'Tunnow', 48),
 ('Russia', 'Bail', 'Goodwin', 46),
 ('Poland', 'Cole', 'Winteringham', 49),
 ('Sweden', 'Emlyn', 'Erricker', 55),
 ('Russia', 'Cathee', 'Sivewright', 49),
 ('Poland', 'Barny', 'Ingerson', 57),
 ('Sweden', 'Sharla', 'Papaccio', 55)]

## Thanks for reading :)
Created by [Tarun Kamboj](https://www.linkedin.com/in/kambojtarun/).